Revit 2027 API
BuiltInFailures.DesignOptionFailures.MustAddKingWarn Property
 In order to add this '[Serf]' to the Option Set, you must also add its '[King]'--if you continue it will not be added to the Option Set
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MustAddKingWarn { get; }
Public Shared ReadOnly Property MustAddKingWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MustAddKingWarn {
	FailureDefinitionId^ get ();
}
static member MustAddKingWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace